Repository: atlas-studios/Session2-G2
Catalog: omegat/project_save.tmx
Source language: zh_cn
Languages: en_us

source: 想起这事轩辕禹忍不住咬了咬牙，埋怨起印家这群老狐狸来。轩辕家是四大世家之一，本来一举一动就受到上青界各派的关注。这两日他对沈萤过分热情的事，也不是什么秘密。想必现在四大家都在猜测她的身份。印家自然也不例外，但他没想到，与其它两家默默观望不同，印风居然会直接找上他，求他引见。
en_us: Xuan Yuanyu gritted his teeth as he thought about this. He began to inwardly curse that bunch of old foxes, the Yin Family. The Xuan Yuan Family was one of the four aristocratic families and everything that they did attracted the attention of the Upper Azure World. It was no secret that Xuan Yuanyu had been overly warm to Shen Ying. Now, everyone in the three other aristocratic families were trying to guess who she was and the Yin Family was no exception. However, Xuan Yuanyu never would have guessed that Yin Feng would react so differently from the other two families who had remained quiet until now. Yin Feng had went straight up to Xuan Yuanyu and requested for him to invite Shen Ying to meet him.

source: 想趁着这个小门派还不成气侯的时候，彻底的打压下去以除后患，保证世家独一无二的地位。偏偏他们现在又抓到了这个大把柄，自然不留余地想压死无敌派。若是以往，对于这种事，大家也就心照不宣了，或许背后还会推一把。
en_us: Trying to suppress this small sect when it had not become established and stable, so as to prevent future troubles and maintain the unique position of the aristocratic families. Since they had chanced upon this opportunity, naturally, they would not give lee way and suppress the Invincible Sect. If it were in the past, everyone would have a mutual understanding and perhaps even give a helping hand.

source: 感受到一股热流从胸口快速朝丹田处涌去，江逸暗暗感慨，有丹药辅助修炼就是好啊，江如虎天资如此差也能修炼到铸鼎境四重，不就是经常把灵神丹当饭吃吗？
en_us: 天资Sensing a wave of heat flow from his chest and surge at quick speed towards his dantian area, Jiang Yi silently sighed with sorrow about how good it must be to have enough elixirs to facilitate power cultivation. If Jiang Ruhu with his innately poor talent could refine his power up to the fourth stage of the Cast Tripod Realm, would it not be the case that he had been consuming Spirit Pills like how one ate rice at meals?

source: 感受到江逸内心的沉重，江小奴笑容凝固了，慌忙跟着江逸朝里屋走去，给江逸到了一杯水，这才睁着大眼睛问道：“少爷，发生了什么事情？”
en_us: As if sensing the heaviness residing in Jiang Yi's heart, Xiaonu's smile froze on her face. She hurriedly followed Jiang Yi into the house, not forgetting to pour a glass of water for him before asking, wide-eyed, "Young Master, what happened?"

source: 感受着丹田内的蓝色元力如井喷般冒出，江逸兴奋无比，这丹药配合黑色元力至少让他修炼速度比原先快了数十倍……
en_us: Sensing the blue essence force inside his dantian spewing out like an oil well blowout, Jiang Yi was uncontrollably excited. Combined with black essence force, this elixir could allow his cultivation speed to increase by at least ten times the original rate...

source: 感受着裂开的骨头快速的愈合，江逸内心狂喜不已，等黑色元力消耗干净之后，又继续调集黑色元力，让疗伤速度加快。
en_us: Feeling the broken bones speedily mending together, Jiang Yi felt much euphoria. He waited for the black essence force to be used up completely before once again continuing to summon more black essence force to speed-up the wound-healing process.

source: 感应到两种不同属性的元力如同孪生兄弟般快速融合着，江逸脸上露出狂喜之色，身子立即从床上跃起，对着床边的青石板重重砸下。
en_us: When he felt the effect of the combined forces of two different attributes fusing together like twin brothers, Jiang Yi was elated. He jumped up and smashed heavily down onto the limestone slab beside the bed.

source: 感觉到双手被震得发麻，左胸传来一阵撕裂般的阵痛，看着对方的手掌再次化作一道残影拍来，江逸苦涩的在心里喃喃起来：“完了，怕是今日和小奴，两人都走不出这风月楼了……”
en_us: Jiang Yi felt his arm turn numb from the clash. A searing pain tore through his left chest. Looking at the opponent's palm turning into a phantom shadow once again, Jiang Yi mumbled bitterly, "It's over. Xiaonu and I won't be able to escape this brothel today…"

source: 慌乱中，江逸双手快速运转全部元力，交叉上架格挡，却忘了昨日尝试无名口诀时提炼出来的那一丝黑色元力还储藏在左臂的某条小经脉处，忘了排出体外。当他全力运转江水诀元力的时候，竟把那丝黑色元力也一并运转了起来。
en_us: Frantically, Jiang Yi transferred out all the essence force as quick as he could and crossed his arms to protect his upper frame. However, he forgot that the little sliver of black essence force he had cultivated using the nameless chant last night was still hidden in a small vein on his left arm and that he had forgotten to force it out of his body. When he spent all his energy to transfer the essence force using the Jiang Water Art, he had accidentally transferred the black essence force together with the other forces as wellu

source: 我就是没有朋友，没有朋友怎么了？关你屁事啊喂！
en_us: I do not have friends, so what? How is that your business!

source: 我累啊！
en_us: But I am!

source: 战斗了一炷香时间，翊凌雪浑身大汗淋漓，完美曲线再次暴露无遗，她却浑然不觉，娇喝一声，双拳如暴雨般呼啸而来，刹那间漫天都是拳影，足足有十个之多。
en_us: After fighting for five minutes, Yi Lingxue's entire body was covered in sweat, allowing her perfect bodily figure to come to light. However, she remained totally unaware of this. Instead, with a delicate shout, she sent both her fists flying like a thunderstorm, leaving the air filled with the silhouettes of fists, numbering ten of such figures, within a split second.

source: 戚栓雨：“……”
en_us: Qi Chengyu: "…"

source: 戚橙雨一急，大声喊道，“别碰她！”居然忘了她还在！原本还想护着这个小姑娘，却没想到她到是受了自己的连累。自己怎么样都无所谓，但沈萤……还是个清白姑娘，绝对不能让她经历那些恶心的事。“她只是个凡人，跟我没有任何关系。你们要是敢动她一下，来日本尊修为恢复之日，定将你们噬骨练魂！”
en_us: Qi Chengyu panicked and shouted, "Don't touch her!" She had totally forgotten about her presence! She had wanted to protect this young lady but never did she expect that she would drag her into this mess. She could accept whatever that would happen to her, but Shen Ying… she was still an innocent lady. She could not allow her to experience such disgusting things. "She is only a mortal, and has no ties with me. If you dare to touch her, the day I recover will be the day I feed on your bones!"

source: 戚橙雨一愣，反弹性的点头，“……能。”
en_us: Puzzled, Qi Chengyu nodded reflexively. "… We can."

source: 戚橙雨一愣，好似这才想起来，唤出武器，就往着对面冲了过去。她像是已经豁出去了，再没有保留，全身阴气大盛。大片的剑光就朝着对面的人身上招呼而去。
en_us: Qi Chengyu fell into a daze before seemingly recalling something and summoned out her weapon, and then headed towards the person opposite her. She looked like she was going all out for it, holding no more reservations as the Yin Qi emanating from her was fully unleashed. The sword in her hand shone and reflected the image of her opponent as it greeted him.

source: 戚橙雨一愣，这才发现她居然是认真的，眼神顿时沉了沉，“为什么？我跟你相熟不过几天，而且你又不清楚我与那人有什么恩怨，你就选择帮我？”
en_us: At first, Qi Chengyu thought she was joking. But then she realised that Shen Ying was being serious. Her eyes immediately darkened. "Why? You have only known me for just a few days, and you also don't know what kind of grievances I have with that person. Why do you want to help me?"

source: 戚橙雨不敢置信的接过，左边翻看了一遍，通行玉牌，真的是悟剑峰的玉牌！灵气一探，上面还隐隐浮出孤月的字样。
en_us: With a look of disbelief, Qi Chengyu took the token from her, giving it a good look-over. It was the passage jade token, it was really the passage jade token of Sword Comprehension Peak! Upon probing it with her Spirit Qi, she could faintly see the word "Lonemoon" written on it.

source: 戚橙雨与甘子睿都是元婴，修为相当，再加上戚橙雨之前受了伤，原本她该是打不过对方的。但顶不住她那不要命的打法，完全放弃了防御，一心只想报仇。况且原本魔修就比仙修的手段多，不到片刻甘子睿就节节败退。越来越被逼入死角。
en_us: Qi Chengyu and Gan Zirui were both Nascent Soul cultivators with similar power levels, and on top of that, Qi Chengyu had been injured previously so logically speaking, she would not be able to defeat her opponent. But the opponent could not handle her crazy, reckless way of fighting; without caring for her own life, she disregarded her defense with the sole purpose of revenge. Moreover, she had more cunning ways at her disposal as compared to immortal cultivators, causing Gan Zirui to retreat in defeat and be forced to a dead corner.

source: 戚橙雨以为她不懂这东西的好处，忍不住又提了一句，“你虽然是凡人，但五阶兽丹难得，凭这定能换到诸多好处。”
en_us: Thinking that she didn't understand the benefits of this pill, Qi Chengyu couldn't help explaining again, "Although you are a mortal, this fifth-level beast pill is a rarity. You can benefit in many ways from it."

source: 戚橙雨先将妖兽头部的浊气练化，灵化化刃直接破开，果然在里面发现了一颗亮闪闪的蓝色珠子，拇指大小的五阶兽丹，而且还是水属性。不由得再次感叹这个凡人的运气，随便走走都能捡到五阶灵兽的尸体，而且杀此灵兽的人，居然没有将兽丹取走。
en_us: Qi Chengyu first cleansed the head of the beast, directly opening it with a spirit cleansing blade. Sure enough, a bright blue bead was found inside it, a fifth-level beast pill, and it was of the water attribute. She could not help but marvel again at this mortal's luck — just by wandering about she had managed to pick up the bodies of fifth-level spirit beasts left behind by a hunter.

source: 戚橙雨再次闭上眼睛，继续调息，刚运行了半个周天……
en_us: Qi Chengyu closed her eyes again and continued to regulate her meridians. Just as she had completed half a cycle…

source: 戚橙雨冷哼笑了一声，满眼的恨意，“你当然不希望我在这，五百年了……我整整找了你五百年，没想到你居然会躲在这里。往日之仇，今日我便与你算个清楚！”
en_us: Qi Chengyu laughed coldly, her expression full of hatred. "You certainly wouldn’t want me here. Five hundred years… I have been looking for you for five hundred years. I didn't expect you to be hiding here. Let's settle our past scores once and for all today!"

source: 戚橙雨吓了一跳，体内的灵气一个岔路差点走火入魔，生生压住到口的鲜血，抬头瞪了她一眼。这人是想找死吧？当真以为自己不会杀她吗？
en_us: Qi Chengyu almost suffered a Qi Deviation at the shock of hearing this voice. Forcing down the fresh blood that had surged up to her mouth, she looked up and glared at Shen Ying. Is this person asking for death? Does she really think that I will not kill her?

source: 戚橙雨呆了呆，眼中柔软了一瞬，半会才噗嗤一声笑了出来，“就你？得了吧！你的小命还是留着多吃几只烤鸡吧？”她一个凡人，又能做什么，“悟剑峰是什么地方？那可是太虚派的圣地，化神尊者闭关悟道的地方。莫说你只是个凡人，就算是元婴修士，都没有入那的资格。”
en_us: Surprised by Shen Ying's offer of help, Qi Chengyu's expression softened for a moment, then she laughed out, "You? Forget it! Save your little life to eat a few more roast chickens!" What could she do? She was just a mortal. "What kind of place do you think Sword Comprehension Peak is? It is the holy land of the Grand Vacuity Sect, the place where Soul Formation cultivators retreat to in order to gain enlightenment. Putting aside the fact that you are just a mortal, even if you were a Soul Formation cultivator, you wouldn’t meet their criteria for entry."

source: 戚橙雨咬了咬牙，似是想起了什么，眼中燃起疯狂的恨意，她找了这么久，原来……原来是躲在了那里。
en_us: Qi Chengyu gritted her teeth, and her eyes became alight with burning hatred as if remembering something. She had searched for so long. So… so he had hidden over there.

source: 戚橙雨嘴角一抽，应该是什么鬼？说好的仙门弟子最看重门派呢？
en_us: Qi Chengyu was at a loss for words. What the heck does 'I think so' mean? Don't all disciples of immortal sects regard their sects highly?

source: 戚橙雨嘴角一抽，重点是个吗？细一想，她只是个凡人，确实需要进食。于是顺手捏诀在地上燃起团火，“灵兽肉有浊气，用灵火练化后才能吃。”说完直接接过她手里已经被拔光了毛的灵兽，架在火上烤了起来。
en_us: Qi Chengyu's mouth twitched. Was this the key point? On closer thought, she remembered that Shen Ying was just a mortal and really needed to eat. So Qi Chengyu formed a seal on the ground and ignited a ball of fire. "The flesh of a spirit beast is putrid, it can only be eaten after cleansing it with spirit fire." So saying, she took over the featherless spirit beast that Shen Ying was holding and placed it in the fire to cook.

source: 戚橙雨心底一梗，这说的是一回事嘛喂！
en_us: Qi Chengyu felt like she was about to choke. Were they on the same topic?

source: 戚橙雨心底升起一股深深的无力感，上上下下打量眼前的人一遍，“你到底怎么活到现在的？”这么粗神经的人，居然还入了玄天宗，宗门的人都瞎了吗？
en_us: A feeling of utter powerlessness overwhelmed Qi Chengyu. She looked up and down at the person in front of her. "How did you manage to survive till now?" She could not believe such a clueless person was actually accepted by the Blackheaven Sect. Was the sect blind?

source: 戚橙雨恨得眼神充血，眼前闪过一幕幕熟悉的画面，那些原本以为摆脱的恶梦，再一次被唤醒，噬骨饮血般一遍遍在眼前播放着，原来就算是入魔，也还是逃不开。
en_us: Qi Chengyu's eyes were raging with anger, and a familiar scene flashed across her eyes. The memories of those nightmares that she had once thought she could escape from were awakened, and they replayed again and again before her eyes. Even joining the ranks of fiend cultivators could not let her escape from all that.

source: 戚橙雨愣了愣，脸色变换了好几次，眼里水光闪烁，朝着他深深行了个礼，“多谢尊者，橙雨谨记！”
en_us: Qi Chengyu was taken aback as her expression changed a few times. Her watery eyes shimmered as she gave him a deep bow. "Thank you, Supremacy. I'll definitely keep that in mind!"

source: 戚橙雨拼着一口气，一路飞出了玄天宗的范围。她伤得很重，就连元婴都有溃散的驱势，全身的经脉已经残破得不成样子。玉鼎老贼果然狡诈，即便她谋划了这么多年，好不容易等到了这个时机。没想到，临死还被他阴了一把。
en_us: On her last legs, Qi Chengyu flew out of the Blackheaven Sect. She was badly hurt; even Nascent Soul cultivators could be driven to the point of collapse. The meridians in her entire body were badly damaged. She had to give it to Yu Ding, that cunning old thief. Even though she had planned this for so many years before the opportunity finally came by, he somehow still managed to injure her before he died.

source: 戚橙雨深吸了好几口气，才压下心底的狂躁。转手接过对方手里的丹药，沉声道，“滚！”
en_us: Qi Chengyu took a deep breath before suppressing the turmoil within her. She took the bottle of elixirs from him and said in a deep voice, "Get lost!"

source: 戚橙雨用兽丹整整调息了一晚上，才让经脉修复了一二成。当初为了躲避玄天宗的追踪，她才特意往灵气稀薄的地方走，却也导致她的伤好得太慢，但好在不会继续恶化下去。兴许晚上她就可以回到冥阴山，唯一让她有些忧心的是……
en_us: Qi Chengyu used a beast pill to help her recuperate and rested for the whole night to finally heal a small part of her meridians. Previously, she had purposely traveled to places where Spirit Qi was scarce in order to avoid being tracked down by the Blackheaven Sect, however it had caused her recovery to be too slow. The only thing to be glad about was that her injury would not worsen. Fortunately, she would be able to return to Ming Yin Mountain, but her only worry was…

source: 戚橙雨的怒气顿时消散了不少，对方却好似并没有多在意这事，反而心大的拔起了鸡毛。一时间满地五颜六色的各色羽毛，映着刚升起的月光，仿佛在地上撒了一层各色的光。
en_us: At this thought, much of Qi Chengyu's anger dissipated, but all this went unnoticed by the other party who had instead started pulling out the feathers of the pheasant. Immediately after, the colorful feathers reflected the light of the rising moon, forming a rainbow-like pattern on the ground.

source: 戚橙雨皱了皱眉，拿出一块白色的圆石，捏了个诀，顿时一个男子的影像就浮在了上面，一身白衣，长得到是规矩端方，一派正人君子的样。
en_us: Frowning, Qi Chengyu took out a white round stone and produced a hand seal. Suddenly the image of a man floated on top of it. He was dressed entirely in white, appearing decent and proper; one got the impression he was a righteous gentleman.

source: 戚橙雨紧了紧手心，想要说点什么，又不知道能说啥，最终只能冷哼一声，“哼，你这性子，早晚让人给卖了！”说完转手把手里已经烤好的鸡塞进对方怀里，“给，快吃！快吃！对了，你叫啥？”
en_us: Clenching her hands, Qi Chengyu wanted to say something, but didn’t know what she could say. In the end, she could only snort coldly and say, "With a character like yours, you will be cheated sooner or later!" So saying she stuffed the roasted bird into the other's arms. "Here, eat quickly! Eat quickly! By the way, what's your name?"

source: 戚橙雨紧了紧身侧的手，“尊者的意思，我明白。”
en_us: Qi Chengyu clenched her hands tightly. "I understand what you mean,Supremacy."

source: 戚橙雨脸色更沉了，手心松紧了好几次，好似在拼命压抑什么，半会深吸了一口气，看了她一眼，似是想挤出一个笑容，抽动的嘴角却满是苦涩，“看来这几天，你也不是光顾着吃鸡。我说的话你到是全听进去了。”
en_us: Qi Chengyu expression became darker and she clenched her hands tightly several times, as if desperately suppressing something. Taking a deep breath, she looked at Shen Ying. She tried hard to smile but her trembling lips could not hide her bitterness. "It seems that during these past few days, your attention was not all spent on eating chicken. You have been listening to what I was saying."

source: 戚橙雨脸色越加的奇怪，看她这样子，也不像能杀死五阶灵兽，难道有人猎兽，扔在河边没管不成。她到是好运气！
en_us: The incredulous look on Qi Chengyu face deepened. Looking at Shen Ying, it didn't seem like she could kill a fifth-level spirit beast. Did some hunter capture the beasts, then abandoned them by the river? She really had good luck!

source: 戚橙雨：“……”
en_us: Qi Chengyu: "…"

source: 房门关闭，姬听雨看到江逸眼中的无奈，浅浅一笑道：“易公子不用担忧，有听雨在，马公子和柳公子不会为难你的。”
en_us: Shutting the doors, Ji Tingyu saw the exasperation in Jiang Yi's eyes and smiled lightly, "Young Master Yi need not worry. Tingyu will not let Young Master Ma and Young Master Liu make things difficult for you."

source: 房门轰然关上，三位公子站了一会全部转身快步离开，这姬小姐三人追求了几年了总是不温不火，三人早就习惯了，也不敢过多的纠缠。
en_us: The door to the room slammed shut. All three gentlemen stood at the same spot for a while, before simultaneously turning around and leaving at a quick pace. This Young Mistress Yi had never been receptive to the three men's attempts at courtship over the past few years, after all. This circumstance was something they were already used to and as such, they did not dare to entangle themselves too much in her affairs.

source: 房间不大，里面有一个壮汉正对着一名瘦弱的小丫头拳打脚踢，那小丫头整个人蜷缩在地，全身都在颤抖，不停的哭喊恳求，但那壮汉却依旧不断拳打脚踢。
en_us: The room was not big, but in it a stout man was kicking and punching a weak, delicate girl. She was curled on the ground, trembling while constantly crying and begging. However, the man continued to rain down attacks upon her.

source: 房间里一片冷清，没有熟悉的昏暗烛火，也没有那个熟悉的柔弱身影，伏在桌上喘息了好一会，江逸才哆嗦着手点燃烛火，却看到桌上压着一张字条。
en_us: The air in the room was stale and cold. It lacked the familiar, warm glow of a candle and that delicate, weak figure. Jiang Yi leaned over on the table-top to catch his breath. After a few minutes of hoarse panting, he finally sat up and lit the candle with a shaking hand. It was then that he spotted a brief message left on the table.

source: 所以……到底挑战的是掌门，还是羿清啊？
en_us: So... who exactly was the one challenged, the sect master or Yi Qing?

source: 所以一开始他佯装妥协，让大部分人放松警惕，然后凭借黑色元力增幅的强大力量，一拳把江如鹰轰飞，此刻再趁着众人震愕之中，准备一举拿下江如虎。
en_us: As such, he posed being pro-compromise right from the start, ensuring a large portion of his opponents would let their guard down. Subsequently, he would rely on his great power, expanded in strength by black essence force, and send Jiang Ruying flying with one punch. At that moment, he would take advantage of all his opponents being in a state of shock, and was ready to take Jiang Ruhu down in a single move.

source: 所以他还是倔强的站在原地，一言不发。
en_us: Thus he still stubbornly stood his ground, not uttering a single word.

source: 所以他顿了一下，不等对方开口就说道：“姬小姐，你们这丹药是收还是不收？不收在下告辞了！”
en_us: As such, he paused for a moment. Not waiting for the other person involved to open her mouth, he just said, "Miss Ji, my elixirs - are you going to accept them, or not? If not, I'm going to take my leave!"

source: 所以听到小奴出事后，江逸立即暴怒起来，满脸狰狞的冲到前院，那如野兽般凶厉的气息把前来报信的少女吓了一跳。
en_us: So when he heard that Xiaonu was in trouble, Jiang Yi exploded with anger. Rushing to the front yard, face brimmed with fury. His ferocious manner gave the messenger girl a huge fright.

source: 所以听说江如虎是被马家的人打了，江家便不予理会了，大总管江云蛇倒是怒气十足，尽管江如虎被打得他都认不出来了，依旧狠狠怒骂了一顿，并下令让江家旁系子弟全部紧闭在家，敢再出去丢人现眼，一律重罚。
en_us: As such, upon hearing that members of the Ma Family had beaten up Jiang Ruhu, the Jiang Clan paid little heed to that piece of information. Contrary to the rest, the Chief Supervisor Jiang Yunshe was filled with rage. Even though Jiang Ruhu had been so brutally injured and mutilated from the fight that his face seemed unrecognisable, Jiang Yunshe still adamantly scolded Jiang Ruhu with much ferocity and even ordered all the collateral descendants to go into seclusion at home. He even set a penalty - should anyone head out of the Residence again and be a disgrace to the Family, there would be a severe punishment.

source: 所以此刻江如龙如一头疯牛般冲来，他脸上神情没有半点变幻，而是快速弯身，提起江如虎的另外一条腿，当做武器在半空中抡起，对着江如龙狠狠砸去。
en_us: Which was why Jiang Rulong just charging him like a frenzied bull. Jiang Yi remained calm and quickly bent over to pick up Jiang Ruhu by his other leg to use him as a weapon to smash at Jiang Rulong.

source: 所以此刻江逸心情很是沉重，风月楼竟是马家的产业？今日可别出乱子啊……
en_us: Ergo, Jiang Yi was feeling pretty heavyhearted right now: who knew that Fengyue Brothel was the property of the Ma Family? He could only hope that nothing would go wrong today...

source: 所以此刻江逸没有选择去武殿，而是回了江家！这段时间内，他要是还敢在江家和武殿中来回行走，他相信自己绝对活不过十天。
en_us: Therefore, Jiang Yi chose to return to the Jiang Clan, instead of the Martial Arts Hall. He was certain that he would not be able to survive past ten days, if he dared commute back and forth between the Jiang Clan and the Martial Arts Hall during this period.

source: 所以说，他干嘛拜她这种师父？专业不对口，害死人啊！
en_us: This was why he should not have asked her to be his master. Their specialties did not even match, and that could lead to harmful consequences!

source: 所以说，他脱裤子真的是为了——开花？！
en_us: So it really was taking off its pants to… bloom flowers?!

source: 所以说，灵主不单不隐藏自己的身份，还打算昭告天下吗？
en_us: So Spirit Master was not hiding his identity anymore - he was planning on announcing it to the world?

source: 所以那只狐妖是想练制结婴丹升上十阶妖王，所以才要抢的吗？那它之前杀人取心是为何？
en_us: So it turned out the fox demon was thinking of refining a neonate formation pill so that it could raise its cultivation level to that of a tenth-level Demon Monarch. That was why it was so desperate to get its hands on it. But why did it have to kill people and take out their hearts?

source: 所有人不忍的别开眼睛，听着耳边传来的清脆骨头断裂声，他们心头一震，回头看着江逸的目光都充满了畏惧。
en_us: Everyone couldn't help but close their eyes, but the sound of bones cracking could be heard clearly. Their minds shuddered as they looked at Jiang Yi with fear.

source: 所有人懵了，只有江豹眼中露出一丝惊恐，他那日的情况和江如鹰一模一样，也是一拳被江逸轰飞……
en_us: Everyone was left dumbstruck. Only Jiang Bao alone had a look of shock and fright revealed through his eyes. His experiences that day were completely similar to what just happened to Jiang Ruying, in that he was also sent flying by a punch from Jiang Yi...

source: 所有人被江逸的凶厉吓到了，也怕江逸发疯之下，真的把江如虎给活活砸死。那样江逸难逃一死，他们也会被家族重罚的。有一人开始退，其余人也慌忙跟着退后，全部惊恐的望着满脸狰狞的江逸，心里都浮现一个念头，这人还是那个老实巴交的废物江逸吗？怎么发狠起来如此可怕？
en_us: Everyone had been shocked and frightened by Jiang Yi's severe viciousness and ferocity; they were also scared that, in a fit of mad rage, Jiang Yi would really smash Jiang Ruhu on the ground to his death. In that way, Jiang Yi's death penalty would be unavoidable, but they too would have to suffer the consequences of being punished by the Family clan. As one person started to retreated, the rest followed suit in hurriedly falling back. All of them stared in horror at the malevolent expression on Jiang Yi's face, as a single thought appeared in their minds - was this person still that docile good-for-nothing Jiang Yi? How could he become so scary when he showed his ferocity?

source: 所谓游仙是指达到了飞升期，却没能成功飞升的修士。为了保命，不得不兵解成游仙。游仙虽然也是修士，算不得真正的仙人，但却是比化神期更强的存在，只是兵解后，再没有飞升的机会。
en_us: The so-called Traveling Immortal referred to those who had already reached the Ascension stage, but were unable to ascend successfully. To save their own lives, they had no choice but to disintegrate and become Traveling Immortals. Although a Traveling Immortal was also a cultivator, and not considered an actual immortal, their existence was stronger than those of the Soul Formation stage, they just did not have the chance to ascend after disintegrating.

source: 所谓陪练，自然是陪着别人练武，帮助对方提高实战经验。换句话说，别人可以随便打你，你也可以还手，但却不能伤了对方，这就是主动挨揍的活儿。
en_us: As a martial arts sparring partner, one naturally had to accompany others in their practice of martial arts and help the other party increase their actual combat experience. In other words, other people could beat you up as they fancied. You could always launch a counter-attack, but you were not allowed to injure the other party: this was the responsibility of actively taking beatings.

source: 才一天没盯着而已，她都干了什么？这些是从哪来的啊喂？
en_us: He had just taken his eyes off her for one day and look what she had done! Where did she get all these creatures?

source: 打劫？
en_us: Rob them?

source: 扫了一眼，江逸很快就意味索然了，这武殿是在招收陪练武者。待遇倒是很诱人，铜牌陪练一天一两银子，银牌陪练一天十两，金牌陪练甚至达到了一两紫金一天。
en_us: After scanning through the notice, Jiang Yi very quickly lost his interest. The Martial Arts Hall was calling for applicants for martial arts sparring partners. Frankly, the remuneration was very attractive: a bronze-token-grade sparring partner would earn a tael of silver a day, one with a silver token would earn ten taels of silver a day, and one with a gold token could even earn up to a tael of purple gold a day.

source: 扫向脚下的人，“他干的？”
en_us: Looking down at the man on the ground, she asked, "Is he the one?"
